zephyrproject-rtos/zephyr/include/zephyr/drivers/clock_control/stm32_clock_control.h
#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(clk_psik), st_stm32c5_xsik_clock, okay)
#define STM32_PSIK_ENABLED	1
#define STM32_PSIK_DIVIDER	DT_STRING_UPPER_TOKEN(DT_NODELABEL(clk_psik), xsik_div)
#define STM32_PSIK_FREQ		DT_PROP(DT_NODELABEL(clk_psik), clock_frequency)
#else
#define STM32_PSIK_DIVIDER	1
#define STM32_PSIK_FREQ		0
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(clk_shsi), fixed_clock, okay)
#define STM32_SHSI_ENABLED	1
#define STM32_SHSI_FREQ	DT_PROP(DT_NODELABEL(clk_shsi), clock_frequency)
#else
#define STM32_SHSI_FREQ	0
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(perck), st_stm32_clock_mux, okay)
#define STM32_CKPER_ENABLED	1
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(cpusw), st_stm32_clock_mux, okay)
#define STM32_CPUSW_ENABLED	1
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic1), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC1_ENABLED	1
#define STM32_IC1_PLL_SRC	DT_PROP(DT_NODELABEL(ic1), pll_src)
#define STM32_IC1_DIV		DT_PROP(DT_NODELABEL(ic1), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic2), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC2_ENABLED	1
#define STM32_IC2_PLL_SRC	DT_PROP(DT_NODELABEL(ic2), pll_src)
#define STM32_IC2_DIV		DT_PROP(DT_NODELABEL(ic2), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic3), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC3_ENABLED	1
#define STM32_IC3_PLL_SRC	DT_PROP(DT_NODELABEL(ic3), pll_src)
#define STM32_IC3_DIV		DT_PROP(DT_NODELABEL(ic3), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic4), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC4_ENABLED	1
#define STM32_IC4_PLL_SRC	DT_PROP(DT_NODELABEL(ic4), pll_src)
#define STM32_IC4_DIV		DT_PROP(DT_NODELABEL(ic4), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic5), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC5_ENABLED	1
#define STM32_IC5_PLL_SRC	DT_PROP(DT_NODELABEL(ic5), pll_src)
#define STM32_IC5_DIV		DT_PROP(DT_NODELABEL(ic5), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic6), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC6_ENABLED	1
#define STM32_IC6_PLL_SRC	DT_PROP(DT_NODELABEL(ic6), pll_src)
#define STM32_IC6_DIV		DT_PROP(DT_NODELABEL(ic6), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic7), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC7_ENABLED	1
#define STM32_IC7_PLL_SRC	DT_PROP(DT_NODELABEL(ic7), pll_src)
#define STM32_IC7_DIV		DT_PROP(DT_NODELABEL(ic7), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic8), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC8_ENABLED	1
#define STM32_IC8_PLL_SRC	DT_PROP(DT_NODELABEL(ic8), pll_src)
#define STM32_IC8_DIV		DT_PROP(DT_NODELABEL(ic8), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic9), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC9_ENABLED	1
#define STM32_IC9_PLL_SRC	DT_PROP(DT_NODELABEL(ic9), pll_src)
#define STM32_IC9_DIV		DT_PROP(DT_NODELABEL(ic9), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic10), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC10_ENABLED	1
#define STM32_IC10_PLL_SRC	DT_PROP(DT_NODELABEL(ic10), pll_src)
#define STM32_IC10_DIV		DT_PROP(DT_NODELABEL(ic10), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic11), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC11_ENABLED	1
#define STM32_IC11_PLL_SRC	DT_PROP(DT_NODELABEL(ic11), pll_src)
#define STM32_IC11_DIV		DT_PROP(DT_NODELABEL(ic11), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic12), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC12_ENABLED	1
#define STM32_IC12_PLL_SRC	DT_PROP(DT_NODELABEL(ic12), pll_src)
#define STM32_IC12_DIV		DT_PROP(DT_NODELABEL(ic12), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic13), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC13_ENABLED	1
#define STM32_IC13_PLL_SRC	DT_PROP(DT_NODELABEL(ic13), pll_src)
#define STM32_IC13_DIV		DT_PROP(DT_NODELABEL(ic13), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic14), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC14_ENABLED	1
#define STM32_IC14_PLL_SRC	DT_PROP(DT_NODELABEL(ic14), pll_src)
#define STM32_IC14_DIV		DT_PROP(DT_NODELABEL(ic14), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic15), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC15_ENABLED	1
#define STM32_IC15_PLL_SRC	DT_PROP(DT_NODELABEL(ic15), pll_src)
#define STM32_IC15_DIV		DT_PROP(DT_NODELABEL(ic15), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic16), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC16_ENABLED	1
#define STM32_IC16_PLL_SRC	DT_PROP(DT_NODELABEL(ic16), pll_src)
#define STM32_IC16_DIV		DT_PROP(DT_NODELABEL(ic16), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic17), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC17_ENABLED	1
#define STM32_IC17_PLL_SRC	DT_PROP(DT_NODELABEL(ic17), pll_src)
#define STM32_IC17_DIV		DT_PROP(DT_NODELABEL(ic17), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic18), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC18_ENABLED	1
#define STM32_IC18_PLL_SRC	DT_PROP(DT_NODELABEL(ic18), pll_src)
#define STM32_IC18_DIV		DT_PROP(DT_NODELABEL(ic18), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic19), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC19_ENABLED	1
#define STM32_IC19_PLL_SRC	DT_PROP(DT_NODELABEL(ic19), pll_src)
#define STM32_IC19_DIV		DT_PROP(DT_NODELABEL(ic19), ic_div)
#endif

#if DT_NODE_HAS_COMPAT_STATUS(DT_NODELABEL(ic20), st_stm32n6_ic_clock_mux, okay)
#define STM32_IC20_ENABLED	1
#define STM32_IC20_PLL_SRC	DT_PROP(DT_NODELABEL(ic20), pll_src)
#define STM32_IC20_DIV		DT_PROP(DT_NODELABEL(ic20), ic_div)
#endif

/** Driver structure definition */

struct stm32_pclken {
	uint32_t bus : STM32_CLOCK_DIV_SHIFT;
	uint32_t div : (32 - STM32_CLOCK_DIV_SHIFT);
	uint32_t enr;
};

/** Device tree clocks helpers  */

/* Get STM32 clock information for an indexed clock phandle in a DT node */
#define STM32_CLOCK_INFO(clk_index, node_id)					\
	{									\
		.bus = DT_CLOCKS_CELL_BY_IDX(node_id, clk_index, bus) &		\
		       GENMASK(STM32_CLOCK_DIV_SHIFT - 1, 0),			\
		.div = DT_CLOCKS_CELL_BY_IDX(node_id, clk_index, bus) >>	\
		       STM32_CLOCK_DIV_SHIFT,					\
		.enr = DT_CLOCKS_CELL_BY_IDX(node_id, clk_index, bits),		\
	}

/* Get an array of STM32 clocks information for clocks listed in a DT node */
#define STM32_DT_CLOCKS(node_id)					\
	{								\
		LISTIFY(DT_NUM_CLOCKS(node_id),				\
			STM32_CLOCK_INFO, (,), node_id)			\
	}

/* Get an array of STM32 clocks information for clocks listed in a @c DT_DRV_COMPAT instance node */
#define STM32_DT_INST_CLOCKS(inst)					\
	STM32_DT_CLOCKS(DT_DRV_INST(inst))

/* Get STM32 clock information for an indexed clock phandle in a @c DT_DRV_COMPAT instance node */
#define STM32_DT_INST_CLOCK_INFO_BY_IDX(clk_index, inst)		\
	STM32_CLOCK_INFO(clk_index, DT_DRV_INST(inst))

/* Get STM32 clock information for clock index 0 in a @c DT_DRV_COMPAT instance node */
#define STM32_DT_INST_CLOCK_INFO(inst)					\
	STM32_DT_INST_CLOCK_INFO_BY_IDX(0, inst)

/* Get STM32 clock information for a named clock phandle in DT node */
#define STM32_DT_CLOCK_INFO_BY_NAME(node_id, name)				\
	{								\
		.bus = DT_CLOCKS_CELL_BY_NAME(node_id, name, bus) &	\
		       GENMASK(STM32_CLOCK_DIV_SHIFT - 1, 0),		\
		.div = DT_CLOCKS_CELL_BY_NAME(node_id, name, bus) >>	\
		       STM32_CLOCK_DIV_SHIFT,				\
		.enr = DT_CLOCKS_CELL_BY_NAME(node_id, name, bits),	\
	}

/* Get STM32 clock information for named clock phandle in a @c DT_DRV_COMPAT instance node */
#define STM32_DT_INST_CLOCK_INFO_BY_NAME(inst, name)			\
	STM32_DT_CLOCK_INFO_BY_NAME(DT_DRV_INST(inst), name)

/* Return true only if at least an enabled instance of the @c DT_DRV_COMPAT has at least 2 clocks */
#define STM32_DOMAIN_CLOCK_INST_SUPPORT(inst) DT_INST_CLOCKS_HAS_IDX(inst, 1) ||
#define STM32_DT_INST_DEV_DOMAIN_CLOCK_SUPPORT				\
		(DT_INST_FOREACH_STATUS_OKAY(STM32_DOMAIN_CLOCK_INST_SUPPORT) 0)

/** Clock source binding accessors */

/**
 * @brief Obtain register field from clock source selection configuration.
 *
 * @param clock clock bit field value.
 */
#define STM32_DT_CLKSEL_REG_GET(clock) \
	(((clock) >> STM32_DT_CLKSEL_REG_SHIFT) & STM32_DT_CLKSEL_REG_MASK)

/**
 * @brief Obtain position field from clock source selection configuration.
 *
 * @param clock Clock bit field value.
 */
#define STM32_DT_CLKSEL_SHIFT_GET(clock) \
	(((clock) >> STM32_DT_CLKSEL_SHIFT_SHIFT) & STM32_DT_CLKSEL_SHIFT_MASK)

/**
 * @brief Obtain mask field from clock source selection configuration.
 *
 * @param clock Clock bit field value.
 */
#define STM32_DT_CLKSEL_MASK_GET(clock) \
	BIT_MASK((((clock) >> STM32_DT_CLKSEL_WIDTH_SHIFT) & STM32_DT_CLKSEL_WIDTH_MASK) + 1)

/**
 * @brief Obtain value field from clock source selection configuration.
 *
 * @param clock Clock bit field value.
 */
#define STM32_DT_CLKSEL_VAL_GET(clock) \
	(((clock) >> STM32_DT_CLKSEL_VAL_SHIFT) & STM32_DT_CLKSEL_VAL_MASK)

#if defined(STM32_HSE_CSS)
/**
 * @brief Called if the HSE clock security system detects a clock fault.
 *
 * The function is called in interrupt context.
 *
 * The default (weakly-linked) implementation does nothing and should be
 * overridden.
 */
void stm32_hse_css_callback(void);
#endif /* STM32_HSE_CSS */

#ifdef CONFIG_SOC_SERIES_STM32WB0X
/**
 * @internal
 * @brief Type definition for LSI frequency update callbacks
 */
typedef void (*lsi_update_cb_t)(uint32_t new_lsi_frequency);

/**
 * @internal
 * @brief Registers a callback to invoke after each runtime measure and
 * update of the LSI frequency is completed.
 *
 * @param cb		Callback to invoke
 * @return 0		Registration successful
 * @return ENOMEM	Too many callbacks registered
 *
 * @note Callbacks are NEVER invoked if runtime LSI measurement is disabled
 */
int stm32wb0_register_lsi_update_callback(lsi_update_cb_t cb);
#endif /* CONFIG_SOC_SERIES_STM32WB0X */

/** @endcond */

/** @} */

#endif /* ZEPHYR_INCLUDE_DRIVERS_CLOCK_CONTROL_STM32_CLOCK_CONTROL_H_ */
